# 1. Створіть список у діапазоні (0, 100) із кроком 1.
# Зв'яжіть його зі змінною.
# Витягніть з нього зріз з 20 по 30 елемент включно.
lst = list(range(101))
print(lst[20:31])
print("---")

# 2. Створіть два списки в діапазоні (0, 100) з кроком 10. Надайте деяким змінним значення цих списків.
lst_1 = list(range(0, 101, 10))
lst_2 = list(range(0, 101, 10))
print("---")

# 3. Витягніть з першого списку другий елемент.
print(lst_1[1])
print("---")

# 4. Змініть останній об'єкт на 200 у другому списку.
# Перейдіть до екрана. <---- ??????????????
lst_2[-1] = 200
print(lst_2)
print("---")

# 5. З'єднайте обидва списки в один, надавши результат нової змінної.
# Виведіть список, що вийшов, на екран.
lst_merged = lst_1 + lst_2
print(lst_merged)
print("---")

# 6. Візьміть зріз зі з'єднаного списку, щоб туди потрапили деякі частини обох перших списків.
# Зріз зв'яжіть з черговою новою змінною. Виведіть значення цієї змінної.
lst_partial = lst_merged[8:14]
print(lst_partial)
print("---")

# 7. Додайте до списку-зрізу два нових елементи і знову виведіть його.
lst_partial.extend([1234, 5678])
print(lst_partial)

# 8. За допомогою функцій min() та max() знайдіть та виведіть елементи об'єднаного списку з максимальним та мінімальним значенням.
print(min(lst_merged))
print(max(lst_merged))
print(lst_merged)

# 9. Напишіть програму, яка обчислює суму всіх непарних чисел в діапазоні від 1 до 90 включно.
print(sum(list(range(1, 91, 2))))
