# 1. Зв'яжіть будь-яку змінну з рядком: «Сьогодні найпрекрасніший день у твоєму житті. . . ».
# Виведіть усі символи цього рядка у зворотному порядку.
text = "Сьогодні найпрекрасніший день у твоєму житті. . . "
print(text[::-1])
print("---")

# 2. Відповісти на питання, чи є істинною умова: 𝑥3 + 𝑦3 ≤ 9. Значення змінних x і y вводяться з клавіатури.
x = int(input("Enter x number: "))
y = int(input("Enter y number: "))
res = x**3 + y**3
print(res <= 9)
print("---")

# 3. Записати умову (скласти логічний вираз), яка є істинною, коли число X парне і менше 100. Х ввести з клавіатури.
x = int(input("Enter x number: "))
print(x % 2 == 0 and x < 100)
print("---")

# 4. Скільки непарних чисел на відрізку [𝑎; 𝑏], якщо 𝑎 і 𝑏 - парні?
# 𝑎 і 𝑏 - непарні?
# 𝑎 - парне, 𝑏 - непарне? 𝑎
# - непарне, 𝑏 - парне?
a = int(input("Enter a number: "))
b = int(input("Enter b number: "))
if a > b:
    a, b = b, a
result = (b + 1) // 2 - a // 2
print(f"Total odd numbers [{a}; {b}] = {result}")
print("---")

# Завдання виконуйте все по порядку: зв'яжіть будь-яку змінну рядком: «Ми обов'язково навчимося програмувати!».
text = "Ми обов'язково навчимося програмувати!"
print("---")

# Витягніть з неї такі зрізи:
# 5. виведіть третій символ цього рядка;
print(text[2])
print("---")

# 6. виведіть передостанній символ цього рядка;
print(text[-2])
print("---")

# 7. виведіть перші п'ять символів цього рядка;
print(text[:5])
print("---")

# 8. виведіть весь рядок, крім двох останніх символів;
print(text[:-2])
print("---")

# 9. виведіть усі символи з парними індексами (вважаючи, що індексація починається з 0);
print(text[::2])
print("---")

# 10. виведіть усі символи з непарними індексами, тобто, починаючи з першого символу рядка;
print(text[1::2])
print("---")

# 11. виведіть чотири символи із центру рядка;
mid = len(text) // 2
print(text[mid-2:mid+2])
print("---")

# 12. виведіть символи з індексами, кратними трьома;
print(text[::3])
print("---")

# 13. виведіть усі символи у зворотному порядку;
print(text[::-1])
print("---")

# 14. виведіть усі символи рядка через один у зворотному порядку, починаючи з останнього;
print(text[::-2])
print("---")

# 15. видаліть друге слово з рядка;
words = text.split(" ")
print(" ".join(words[:1] + words[2:]))
print("---")

# 16. замініть друге слово на рядок «ніколи не»;
print(" ".join(words[:1] + ["ніколи не"] + words[2:]))
print("---")

# 17. додайте на кінець рядка «на Python»;
print(text[:-1] + " на Python" + text[-1])
print("---")

# 18. поставте останнє слово першим у рядку;
print(" ".join([words[-1]] + words[:-1]))
print("---")

# 19. Виведіть довжину цього рядка. Даний рядок s = "У лісі я зустрів 27 вовків, 4 з них були сірі, я схопив палицю, і він втік."
text = "У лісі я зустрів 27 вовків, 4 з них були сірі, я схопив палицю, і він втік."
print(len(text))
print("---")

# 20. Визначити, чи у рядку зустрічається буква «я».
# Відобразити її позицію (індекс) у рядку.
# Визначте, скільки разів буква «у» зустрічається у рядку.
print("я" in text)
if "я" in text:
    print(text.index("я"))
if "у" in text:
    print(text.index("у"))
print("---")

# 21. Визначити, чи складається рядок тільки з літер, якщо ні, то вивести рядок у верхньому регістрі.
# Визначити довжину рядка. ЯКЩО рядок довше 4 символів, то вивести рядок в нижньому регістрі.
if not text.isalpha():
    print(text.upper())
if len(text) > 4:
    print(text.lower())

print("---")

# 22. Замініть перший символ у рядку на «О».
# Відобразіть результат на екрані.
# Визначити, чи складається рядок лише з цифр, якщо ні, то вивести рядок у нижньому регістрі.
letters = list(text)
new_letters = letters.copy()
new_letters[0] = "О"
print("".join(new_letters))
if not text.isdigit():
    print(text.lower())
print("---")

# 23. Визначити, чи трапляється у рядку буква «ж».
# Визначити довжину рядка.
# Якщо рядок довше 8 символів, то виведіть рядок у зворотному порядку.
print("ж" in text)
print(len(text))
if len(text) > 8:
    print(text[::-1])
print("---")

# 24. Визначити кількість літер та цифр у рядку.
print("Total numbers:", len([i for i in text if i.isdigit()]))
print("Total letters:", len([i for i in text if i.isalpha()]))
print("---")

# 25. Перенести першу половину рядка у протилежний регістр і вивести у зворотному порядку.
print(text[:len(text)//2].swapcase()[::-1])
print("---")

# 26.Замініть останній символ у рядку на "P".
# Відобразіть результат на екрані.
# Визначте, скільки разів літера "о" зустрічається в рядку.
new_letters = letters.copy()
new_letters[-1] = "P"
print("".join(new_letters))
print(text.count("о"))
print("---")

# 27.Визначити, чи містить рядок підрядок "вті".
# Відобразити його позицію (індекс) у рядку.
# Визначити довжину рядка. ЯКЩО рядок довше 16 символів, то скоротите рядок до 16 символів.
print("вті" in text)
if "вті" in text:
    print(text.index("вті"))
if len(text) > 16:
    print(text[:16])
print("---")

# 28.Створіть новий рядок за таким правилом:
# замість кожної цифри вставте символ на відповідне місце у вихідному рядку
# (тобто замість цифри 5 повинен стояти 5-й символ рядка)
new_text = []
for symbol in letters:
    if symbol.isdigit():
        new_text.append(letters[int(symbol)])
    else:
        new_text.append(symbol)
print("".join(new_text))
print("---")

# 29.Розділіть рядок на три частини.
# Виведіть останню третину великими літерами,
# потім першу третину малими літерами,
# потім другу третину без змін.
first = text[:len(text) // 3]
second = text[len(text) // 3:(len(text) // 3) * 2]
third = text[(len(text) // 3) * 2:]
print(third.upper())
print(first.lower())
print(second)
print("---")

# 30.Створіть новий рядок за таким правилом:
# замість кожної цифри вставьте символ у відповідному місці вихідного рядка,
# рахуючи з кінця рядка
# (тобто замість цифри 5 повинен стояти 5-й символ рядка, рахуючи з кінця).
new_text = []
for symbol in letters:
    if symbol.isdigit():
        new_text.append(letters[-int(symbol)])
    else:
        new_text.append(symbol)
print("".join(new_text))
print("---")

# 31.Порахуйте кількість прогалин і ком в заданому рядку.
print(text.count(" "))
print(text.count(","))
print("---")

# 32.Замініть коми у вихідному рядку на фрагменти тексту, введені з клавіатури.
new_val = input("Input value to replace commas: ")
print(text.replace(",", new_val))
print("---")

# 33*. Наведіть приклади до кожного методу рядків з таблиці.
# upper()
# lower()
# split()
# replace()
# find()
# count()
